# OnShutdown Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalApplication..::..OnShutdown Method
IExternalApplication Interface See Also
---
Implement this method to execute some tasks when Autodesk Revit shuts down.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
Result OnShutdown(
	UIControlledApplication application
)
```

Visual Basic
---
```text
Function OnShutdown ( _
	application As UIControlledApplication _
) As Result
```

Visual C++
---
```text
Result OnShutdown(
	UIControlledApplication^ application
)
```

# ### Parameters
application
    Type: Autodesk.Revit.UI..::..UIControlledApplicationA handle to the application being shut down.
# ### Return Value
Indicates if the external application completes its work successfully.
# See Also
IExternalApplication Interface
Autodesk.Revit.UI Namespace